Terraform Plan:
```aws_efs_mount_target.efs_prometheus_mt["subnet-0dd981dc576918c96"]: Refreshing state... [id=fsmt-06d19b233905805db]
aws_efs_mount_target.efs_grafana_mt["subnet-03869eba2620a72a4"]: Refreshing state... [id=fsmt-0f6c0057cd74ab816]
aws_efs_mount_target.efs_prometheus_mt["subnet-03869eba2620a72a4"]: Refreshing state... [id=fsmt-018fd38abb3272337]
aws_ecs_cluster.fargate_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster]
aws_efs_file_system.efs_prometheus: Refreshing state... [id=fs-031dac1ce266a92c7]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role]
aws_efs_file_system.efs_grafana: Refreshing state... [id=fs-0e3471ee7cfd1a176]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_efs_mount_target.efs_grafana_mt["subnet-0dd981dc576918c96"]: Refreshing state... [id=fsmt-0d08edfda6c7313d3]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-0769fc3f0a1e0369d]
aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_execution_role:ecs_execution_role_policy]
aws_ecs_task_definition.grafana: Refreshing state... [id=grafana]
aws_ecs_task_definition.prometheus: Refreshing state... [id=prometheus]
aws_subnet.private2: Refreshing state... [id=subnet-03869eba2620a72a4]
aws_internet_gateway.gw: Refreshing state... [id=igw-023eff6b19fbc8386]
aws_subnet.public1: Refreshing state... [id=subnet-0e8a8b2387a038517]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_subnet.private1: Refreshing state... [id=subnet-0dd981dc576918c96]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/80498dd36909bb7a]
aws_security_group.fargate_sg: Refreshing state... [id=sg-0788f6d6e7e5e4270]
aws_nat_gateway.nat: Refreshing state... [id=nat-0e9b83e07e82ff8ea]
aws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/20f01ea24b47aea8]
aws_ecs_service.prometheus_service: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/prometheus-service]
aws_route_table.private: Refreshing state... [id=rtb-00c56dde623266ee6]
aws_route_table.public: Refreshing state... [id=rtb-054b7988ab4f56ef5]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-0e8b878ffd48b9d71]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-0530eb8faa8321338]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0577b7cf0865f9b59]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-0a6f1e2a1d786d5c9]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/20f01ea24b47aea8/7691719dfc462932]
aws_ecs_service.grafana_service: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/grafana-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.grafana_service will be updated in-place
  ~ resource "aws_ecs_service" "grafana_service" {
        id                                 = "arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/grafana-service"
        name                               = "grafana-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana:8" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.prometheus_service will be updated in-place
  ~ resource "aws_ecs_service" "prometheus_service" {
        id                                 = "arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/prometheus-service"
        name                               = "prometheus-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus:5" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.grafana must be replaced
-/+ resource "aws_ecs_task_definition" "grafana" {
      ~ arn                      = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - mountPoints      = [
                      - {
                          - containerPath = "/var/lib/grafana"
                          - sourceVolume  = "grafana-volume"
                        },
                    ]
                    name             = "grafana"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "grafana" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "grafana-volume" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-0e3471ee7cfd1a176" -> null
              - root_directory          = "/" -> null
              - transit_encryption_port = 0 -> null
            }
        }
    }

  # aws_ecs_task_definition.prometheus must be replaced
-/+ resource "aws_ecs_task_definition" "prometheus" {
      ~ arn                      = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - mountPoints      = [
                      - {
                          - containerPath = "/prometheus"
                          - sourceVolume  = "prometheus-volume"
                        },
                    ]
                    name             = "prometheus"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "prometheus" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "prometheus-volume" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-031dac1ce266a92c7" -> null
              - root_directory          = "/" -> null
              - transit_encryption_port = 0 -> null
            }
        }
    }

  # aws_efs_file_system.efs_grafana will be destroyed
  # (because aws_efs_file_system.efs_grafana is not in configuration)
  - resource "aws_efs_file_system" "efs_grafana" {
      - arn                             = "arn:aws:elasticfilesystem:us-east-1:941133421128:file-system/fs-0e3471ee7cfd1a176" -> null
      - creation_token                  = "efs-grafana" -> null
      - dns_name                        = "fs-0e3471ee7cfd1a176.efs.us-east-1.amazonaws.com" -> null
      - encrypted                       = false -> null
      - id                              = "fs-0e3471ee7cfd1a176" -> null
      - name                            = "efs-grafana" -> null
      - number_of_mount_targets         = 2 -> null
      - owner_id                        = "941133421128" -> null
      - performance_mode                = "generalPurpose" -> null
      - provisioned_throughput_in_mibps = 0 -> null
      - size_in_bytes                   = [
          - {
              - value             = 1263616
              - value_in_ia       = 0
              - value_in_standard = 1263616
            },
        ] -> null
      - tags                            = {
          - "Name" = "efs-grafana"
        } -> null
      - tags_all                        = {
          - "Name" = "efs-grafana"
        } -> null
      - throughput_mode                 = "bursting" -> null

      - protection {
          - replication_overwrite = "ENABLED" -> null
        }
    }

  # aws_efs_file_system.efs_prometheus will be destroyed
  # (because aws_efs_file_system.efs_prometheus is not in configuration)
  - resource "aws_efs_file_system" "efs_prometheus" {
      - arn                             = "arn:aws:elasticfilesystem:us-east-1:941133421128:file-system/fs-031dac1ce266a92c7" -> null
      - creation_token                  = "efs-prometheus" -> null
      - dns_name                        = "fs-031dac1ce266a92c7.efs.us-east-1.amazonaws.com" -> null
      - encrypted                       = false -> null
      - id                              = "fs-031dac1ce266a92c7" -> null
      - name                            = "efs-prometheus" -> null
      - number_of_mount_targets         = 2 -> null
      - owner_id                        = "941133421128" -> null
      - performance_mode                = "generalPurpose" -> null
      - provisioned_throughput_in_mibps = 0 -> null
      - size_in_bytes                   = [
          - {
              - value             = 6144
              - value_in_ia       = 0
              - value_in_standard = 6144
            },
        ] -> null
      - tags                            = {
          - "Name" = "efs-prometheus"
        } -> null
      - tags_all                        = {
          - "Name" = "efs-prometheus"
        } -> null
      - throughput_mode                 = "bursting" -> null

      - protection {
          - replication_overwrite = "ENABLED" -> null
        }
    }

  # aws_efs_mount_target.efs_grafana_mt["subnet-03869eba2620a72a4"] will be destroyed
  # (because aws_efs_mount_target.efs_grafana_mt is not in configuration)
  - resource "aws_efs_mount_target" "efs_grafana_mt" {
      - availability_zone_id   = "use1-az1" -> null
      - availability_zone_name = "us-east-1b" -> null
      - dns_name               = "fs-0e3471ee7cfd1a176.efs.us-east-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:us-east-1:941133421128:file-system/fs-0e3471ee7cfd1a176" -> null
      - file_system_id         = "fs-0e3471ee7cfd1a176" -> null
      - id                     = "fsmt-0f6c0057cd74ab816" -> null
      - ip_address             = "10.0.4.82" -> null
      - mount_target_dns_name  = "us-east-1b.fs-0e3471ee7cfd1a176.efs.us-east-1.amazonaws.com" -> null
      - network_interface_id   = "eni-0362e244df1e54646" -> null
      - owner_id               = "941133421128" -> null
      - security_groups        = [
          - "sg-0788f6d6e7e5e4270",
        ] -> null
      - subnet_id              = "subnet-03869eba2620a72a4" -> null
    }

  # aws_efs_mount_target.efs_grafana_mt["subnet-0dd981dc576918c96"] will be destroyed
  # (because aws_efs_mount_target.efs_grafana_mt is not in configuration)
  - resource "aws_efs_mount_target" "efs_grafana_mt" {
      - availability_zone_id   = "use1-az6" -> null
      - availability_zone_name = "us-east-1a" -> null
      - dns_name               = "fs-0e3471ee7cfd1a176.efs.us-east-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:us-east-1:941133421128:file-system/fs-0e3471ee7cfd1a176" -> null
      - file_system_id         = "fs-0e3471ee7cfd1a176" -> null
      - id                     = "fsmt-0d08edfda6c7313d3" -> null
      - ip_address             = "10.0.3.124" -> null
      - mount_target_dns_name  = "us-east-1a.fs-0e3471ee7cfd1a176.efs.us-east-1.amazonaws.com" -> null
      - network_interface_id   = "eni-062a056478ec50b37" -> null
      - owner_id               = "941133421128" -> null
      - security_groups        = [
          - "sg-0788f6d6e7e5e4270",
        ] -> null
      - subnet_id              = "subnet-0dd981dc576918c96" -> null
    }

  # aws_efs_mount_target.efs_prometheus_mt["subnet-03869eba2620a72a4"] will be destroyed
  # (because aws_efs_mount_target.efs_prometheus_mt is not in configuration)
  - resource "aws_efs_mount_target" "efs_prometheus_mt" {
      - availability_zone_id   = "use1-az1" -> null
      - availability_zone_name = "us-east-1b" -> null
      - dns_name               = "fs-031dac1ce266a92c7.efs.us-east-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:us-east-1:941133421128:file-system/fs-031dac1ce266a92c7" -> null
      - file_system_id         = "fs-031dac1ce266a92c7" -> null
      - id                     = "fsmt-018fd38abb3272337" -> null
      - ip_address             = "10.0.4.17" -> null
      - mount_target_dns_name  = "us-east-1b.fs-031dac1ce266a92c7.efs.us-east-1.amazonaws.com" -> null
      - network_interface_id   = "eni-0dd426e62acb5c38b" -> null
      - owner_id               = "941133421128" -> null
      - security_groups        = [
          - "sg-0788f6d6e7e5e4270",
        ] -> null
      - subnet_id              = "subnet-03869eba2620a72a4" -> null
    }

  # aws_efs_mount_target.efs_prometheus_mt["subnet-0dd981dc576918c96"] will be destroyed
  # (because aws_efs_mount_target.efs_prometheus_mt is not in configuration)
  - resource "aws_efs_mount_target" "efs_prometheus_mt" {
      - availability_zone_id   = "use1-az6" -> null
      - availability_zone_name = "us-east-1a" -> null
      - dns_name               = "fs-031dac1ce266a92c7.efs.us-east-1.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:us-east-1:941133421128:file-system/fs-031dac1ce266a92c7" -> null
      - file_system_id         = "fs-031dac1ce266a92c7" -> null
      - id                     = "fsmt-06d19b233905805db" -> null
      - ip_address             = "10.0.3.11" -> null
      - mount_target_dns_name  = "us-east-1a.fs-031dac1ce266a92c7.efs.us-east-1.amazonaws.com" -> null
      - network_interface_id   = "eni-0c371a4e920759287" -> null
      - owner_id               = "941133421128" -> null
      - security_groups        = [
          - "sg-0788f6d6e7e5e4270",
        ] -> null
      - subnet_id              = "subnet-0dd981dc576918c96" -> null
    }

Plan: 2 to add, 2 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```